/**
 * @file   	%<%NAME%>%.%<%EXTENSION%>%
 * @author 	%<%USER%>%
 * @version
 * @date 	%<%DATE%>%, %<%TIME%>%
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "../inc/UDI_uart_debug_information.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
static void
UDI_Init_UART3_RxTx(
    unsigned int baudrate);

static void
UDI_Init_IO_Ports(void);

static void
UDI_Init_DMA_For_Tx(void);
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
UDI_Init_All_UART3_RxTx_With_DMA_Tx(
    unsigned int baudrate)
{
	UDI_Init_IO_Ports();
	UDI_Init_DMA_For_Tx();
	UDI_Init_UART3_RxTx(baudrate);
}

void
UDI_Init_UART3_RxTx(
    unsigned int baudrate)
{

}

void
UDI_Init_IO_Ports(void)
{

}

void
UDI_Init_DMA_For_Tx(void)
{

}

void
UDI_StartForceUartDMATransmit(
    unsigned int *pMemSrc,
    unsigned int cnt)
{

}

/* Написать обработчик прерывания */
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
